[
  {
    "company":["ANZ Bank"],
    "logo":"data/anz_logo.png",
    "dates":["01/17–Present"],
    "lengths":["11months"],
    "locations":["Sydney, Austrlia"],
    "roles":["Senior Java Web Developer"],
    "desc":"Currently working on a Risk data aggregation + calculation web app built with Spring Boot partitioned as Microservices, SQL Server 2008, Java 8 and Vaadin 7 for UI.",
    "highlights":  [
      "increased usage of Java 8 not only in backend but in UI as well with Vaadin",
      "improved code quality with betterment of unit testing skills with use of Junit, AssertJ, Mockito, Selenium and JaCoCo",
      "in the Microservices world, better understanding of REST, OAuth + JWT, Swagger and Spring Boot",
      "gained business knowledge on contingent collateral and risk weight calculations"
    ]
  },
  {
    "company":["Macquarie Group", "Macquarie Offshore Services"],
    "logo":"data/macquarie_logo.png",
    "dates":["04/16–10/16", "04/10–01/16"],
    "lengths":["7months", "5years 9months"],
    "locations":["Sydney, Austrlia", "Makati City, Philippines"],
    "roles":["Senior Java Web Developer (Manager)"],
    "desc":"Worked on Java Web apps developed with Spring, Hibernate, jQuery, ExtJS for Macquarie's risk management department. Over 6 years, primarily worked in Java however had exposure to a variety of technologies such as: maintaining legacy reports & jobs written in SQL + Unix, writing ad-hoc SQL scripts, integrating, customizing and deploying vendor products. Last project was a greenfield app for trade lifecycle reporting which was built on Spring Boot, Microservices, MarkLogic (NoSQL), ReactJS and Bootstrap.",
    "highlights":  [
      "promoted to Manager on Apr 2013",
      "awarded on March 2012 with “RMG Awards: Delivery and Drive“ for singlehandedly analyzing / developing the fix for the bank’s integration errors due to ASIC’s regulatory webservice upgrade and providing manual workaround that prevented regulatory breach and penalties",
      "awarded on November 2012 with “RMG Awards: Delivery and Drive“ for successfully leading / delivering a major development project on schedule even with understaffed team (3 members)",
      "awarded on May 2014 with “RMG Awards: Client Commitment, Highest Standards, Delivery and Drive“ for successfully implementing the IT solutions as envisioned by business users thereby realizing the efficiency gains in business process, if not going beyond expectations",
      "managed and deployed the upgrade of vendor application Actimize Risk Case Manager (RCM); it was highly successful as compared to previous upgrades which had numerous post production issues",
      "member of the pioneer dev team for Sailpoint IIQ (IAM) that was deployed to Sydney, Australia for 5 months; assigned as lead customized reports and connector developer; success of this project paved to growth of hiring developers in Manila"
    ]
  },
  {
    "company":["Tyro Payments"],
    "logo":"data/tyro_logo.png",
    "dates":["10/17–11/17"],
    "lengths":["1.5months"],
    "locations":["Sydney, Austrlia"],
    "roles":["Senior Java Web Developer"],
    "desc":"Took a huge risk & ventured the world of strict full-time pair-programming (wholeday, everyday). Unfortunately, full-time pairing took its toll and I was unable to perform at full capacity.",
    "highlights":  [
      "recovered from this setback and persevered with my Java career",
      "got a short glimpse of the Payment domain and experienced albeit shortly, extreme Agile programming"
    ]
  },
  {
    "company":["Sun Life Financial Philippines"],
    "logo":"data/sunlife_logo.png",
    "dates":["04/07–04/10"],
    "lengths":["3years"],
    "locations":["Makati City, Philippines"],
    "roles":["Java Analyst Programmer"],
    "desc":"Worked as a Java, Web and SQL Developer who implemented business requirements that revolve in insurance domain. Primarily used Spring, Struts, Hibernate but also worked on maintaining legacy apps written in plain JSP + Servlets + JDBC and a Point-of-Sale (POS) payment gateway.",
    "highlights":  [
      "promoted to Analyst Java Developer on Nov 2008",
      "analyzed and fixed synchronization issue in Payment Portal that causes double charging of users’ credit card (issue existed since 2003); reduced 90% of support calls related to reversing credit card charges",
      "analyzed and improved Agents’ Web App daily average of ~317 SQLExceptions to ~10 (issue existed since 2004); reduced 97 % of excessive database exceptions that were the root cause of system’s major erratic behaviour",
      "proposed, designed and implemented a Error Feedback module for Agents’ Web App that stores users’ error reports accompanied with system generated screenshots; increased 60% of support team’s turnaround time by helping them track error reports and providing them accurate data through the screen snapshots"
    ]
  },
  {
    "company":["Azeus Systems Philippines Ltd"],
    "logo":"data/azeus_logo.png",
    "dates":["06/06–11/06"],
    "lengths":["6months"],
    "locations":["Ortigas City, Philippines"],
    "roles":["Junior Developer"],
    "desc":"Worked as a Java Junior Developer under the tutelage of senior mentors for this CMMI Level-5 software firm",
    "highlights":  [
      "passed the notorious test/interview of this CMM5 company and secured 1 of 8 junior developer slots allotted for the year 2006",
      "passed the bootcamp training (Java, SQL) with high marks"
    ]
  }
]
